Config/Documents/BonusesOperation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>BonusesOperation</Name>
			<BasedOn>
				<xr:Item>Catalog.DiscountCards</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Bonuses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BonusesOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BonusesQuantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Card</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Guest</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuestGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>990</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BonusOperationSources</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BonusesValidity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpiryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentDoc</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InputAccumulatingDiscountBalances</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccumulationRegisters/Bonuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Bonuses</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Card</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ExpiryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Enums/BonusesOperationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>BonusesOperationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Receipt</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expense</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/DiscountCards.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>DiscountCards</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>LoyaltyType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LoyaltyType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ClientTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Identifier</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlocked</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlockedAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlockedDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Consumer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SourcesOfBusiness</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TurnOffAutomaticDiscounts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Folio</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Folio</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateHotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentDiscountCard</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/BonusesOperation/Ext/ObjectModule.bsl
#Region EventHandlers

// --------------------------------------------------------------------------------
Procedure Posting(pCancel, pMode)
	If DataExchange.Load Then
		Return;
	EndIf;
	If Not ValueIsFilled(Card) Then
		pCancel = True;

		vMsg = NStr("en = 'Card should be filled!'; 
					|de = 'Eine Karte angeben müssen!'; 
					|ru = 'Карта должна быть указана!'");
		vUsrMsg = New UserMessage();
		vUsrMsg.Text = vMsg;
		vUsrMsg.Message();
	EndIf;
	If Not ValueIsFilled(Card.LoyaltyType) Then
		pCancel = True;

		vMsg = NStr("en = 'Card loyalty type should be filled!'; 
					|de = 'Der Kartenloyalitätstyp sollte ausgefüllt werden!'; 
					|ru = 'У карты должен быть указан вид системы лояльности!'");

		vUsrMsg = New UserMessage();
		vUsrMsg.Text = vMsg;
		vUsrMsg.Message();
	EndIf;
	If Not ValueIsFilled(Card.DiscountType) Then
		pCancel = True;

		vMsg = NStr("en = 'Card discount type should be filled!'; 
					|de = 'Der Kartenrabatttyp sollte ausgefüllt werden!'; 
					|ru = 'У карты должен быть указан тип скидки!'");

		vUsrMsg = New UserMessage();
		vUsrMsg.Text = vMsg;
		vUsrMsg.Message();
	EndIf;     

	RegisterRecords.Bonuses.Write = True;

	If ValueIsFilled(Date) Then
		If OperationType = Enums.BonusesOperationTypes.Receipt Then
			vRecord = RegisterRecords.Bonuses.Add();
			vRecord.RecordType = AccumulationRecordType.Receipt;
			vRecord.Period = Date;
			vRecord.Card = Card;
			If ValueIsFilled(ExpiryDate) Then
				vRecord.ExpiryDate = ExpiryDate;
			ElsIf BonusesValidity > 0 Then
				vRecord.ExpiryDate = BegOfDay(Date) + BonusesValidity * (24*3600);
			Else
				vRecord.ExpiryDate = '00010101';
			EndIf;
			vRecord.Quantity = BonusesQuantity;
		ElsIf OperationType = Enums.BonusesOperationTypes.Expense Then 	
			If BonusesValidity > 0 And BonusesQuantity > 0 And Not ValueIsFilled(ExpiryDate) Then
				vBonusesQuantity = BonusesQuantity;
				vBonusesBalances = cmGetBonusesBalancePerExpiryDates(Card, Date);
				
				For Each vBonusesBalancesRow In vBonusesBalances Do
					If vBonusesBalancesRow.QuantityBalance > 0 Then
						vRecord = RegisterRecords.Bonuses.Add();
						vRecord.RecordType = AccumulationRecordType.Expense;
						vRecord.Period = Date;
						vRecord.Card = Card;
						vRecord.ExpiryDate = vBonusesBalancesRow.ExpiryDate;
						vRecord.Quantity = Min(vBonusesBalancesRow.QuantityBalance, vBonusesQuantity);
						
						vBonusesQuantity = vBonusesQuantity - vRecord.Quantity;
						If vBonusesQuantity <= 0 Then
							Break;
						EndIf;
					EndIf;
				EndDo;
				
				// Check that all bonuses were written off
				If vBonusesQuantity > 0 Then
					If AdditionalProperties.Property("DoCheckBalance") And AdditionalProperties.DoCheckBalance Then
						pCancel = True;
						
						vMsg = StrTemplate(NStr("en='There are not enough bonuses at the loyalty card %1! Short off %2 bonuses'; 
						                       |ru='На карте лояльности %1 недостаточно бонусов! Не хватает %2 бонусов'; 
								               |de='Es gibt nicht genug Boni auf der Treuekarte %1! Fehlt Boni %2'"),
						                   TrimAll(Card), 
						                   Format(vBonusesQuantity, "NZ=; NG="));
										   
						vUsrMsg = New UserMessage();
						vUsrMsg.Text = vMsg;
						vUsrMsg.Message();
					Else
						vRecord = RegisterRecords.Bonuses.Add();
						vRecord.RecordType = AccumulationRecordType.Expense;
						vRecord.Period = Date;
						vRecord.Card = Card;
						vRecord.ExpiryDate = '00010101';
						vRecord.Quantity = vBonusesQuantity;
					EndIf;
				EndIf;
			Else
				vRecord = RegisterRecords.Bonuses.Add();
				vRecord.RecordType = AccumulationRecordType.Expense;
				vRecord.Period = Date;
				vRecord.Card = Card;
				vRecord.ExpiryDate = ExpiryDate;
				vRecord.Quantity = BonusesQuantity;
			EndIf;
		EndIf;

		// Send sms and email 
	    SendSMS();
	EndIf;
EndProcedure

// --------------------------------------------------------------------------------
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;
	If Not IsNew() Then
		If Ref.BonusesQuantity <> BonusesQuantity or Ref.Card <> Card Then
			ChangeAuthor = SessionParameters.CurrentUser;
			ChangeDate = CurrentSessionDate();
		EndIf;
	EndIf;
    AdditionalProperties.Insert("IsNew", IsNew());
EndProcedure

// --------------------------------------------------------------------------------
Procedure Filling(FillingData, FillingText, StandardProcessing)
	If IsNew() Then
		Author = SessionParameters.CurrentUser;
		Date = CurrentSessionDate();
		OperationType = Enums.BonusesOperationTypes.Receipt;
		Hotel = SessionParameters.CurrentHotel;
	EndIf;
	If TypeOf(FillingData) = Type("CatalogRef.DiscountCards") Then
		Card = FillingData;
		Guest = FillingData.Client;
		Hotel = FillingData.CreateHotel;
		If ValueIsFilled(Card) And ValueIsFilled(Card.DiscountType) And ValueIsFilled(Card.DiscountType.BonusesValidity) Then
			BonusesValidity = Card.DiscountType.BonusesValidity;
		EndIf;
	EndIf;	
EndProcedure

// -----------------------------------------------------------------------------
Procedure OnSetNewNumber(pStandardProcessing, pPrefix)
	vPrefix = "";
	If ValueIsFilled(Hotel) Then
		vPrefix = Catalogs.Hotels.pmGetPrefix(Hotel);
	EndIf;
	If ValueIsFilled(SessionParameters.CurrentHotel) Then
		vPrefix = Catalogs.Hotels.pmGetPrefix(SessionParameters.CurrentHotel);
	EndIf;
	If vPrefix <> "" Then
		pPrefix = vPrefix;
	EndIf;
EndProcedure // OnSetNewNumber

// -----------------------------------------------------------------------------
Procedure OnCopy(pCopiedObject)
	Author = SessionParameters.CurrentUser;
	ChangeAuthor = Undefined;
	ChangeDate = '00010101';
	ExternalCode = "";
EndProcedure // OnCopy

// -----------------------------------------------------------------------------
Procedure FillCheckProcessing(pCancel, pCheckedAttributes)
	If AdditionalProperties.Property("CheckedAttributes") Then
		For Each vId In AdditionalProperties.CheckedAttributes Do
			pCheckedAttributes.Add(vId);       
		EndDo;	
	EndIf;
EndProcedure

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
Procedure SendSMS()
    If ValueIsFilled(Card) And ValueIsFilled(Card.DiscountType) And AdditionalProperties.IsNew Then
        vDiscountType = Card.DiscountType;
        If vDiscountType.InformClientWhenChargingOrStorno And ValueIsFilled(vDiscountType.DeliveryType) And ValueIsFilled(vDiscountType.SMSTemplate) Then
            vLanguage = Catalogs.Languages.RU;
            vDeliveryType = vDiscountType.DeliveryType;
            If ValueIsFilled(Guest) Then
                vLanguage = Guest.Language;
            EndIf;
            vSMSTemplate = vDiscountType.SMSTemplate;
            vSMSTemplateText = SMS.GetSMSTextByLanguage(vSMSTemplate, vLanguage);
            vSMSText = SMS.ReplaceSMSParameters(vSMSTemplateText, Ref, Guest);
            vOperationParametrs = New Array;
            vReceiversA = New Array();
            vReceiversA.Add(New Structure("LineNumber, Phone, EMail, Client, Customer, SMSText, Cost, IsSent, Result, MessageID, ClientDoc, ParentDoc, AmountStr, DiscountCard",
                                            1,
                                            Guest.Phone,
                                            Guest.EMail,
                                            Guest,
                                            Undefined,
                                            vSMSText,
                                            0,
                                            False,
                                            "",
                                            "",
                                            Ref,
											Ref, 
											"",
											Catalogs.DiscountCards.EmptyRef()));		
            
            vOperationParametrs.Add(vReceiversA);
            vOperationParametrs.Add(vDiscountType.DeliveryType);
            vOperationParametrs.Add(0);     // DistributionListId
            vOperationParametrs.Add("");    // AttachmentPath
            vOperationParametrs.Add(False); // IsByCustomers
            vOperationParametrs.Add(vSMSTemplate);
            vOperationParametrs.Add(vSMSTemplate.Sender);
            
            AsyncCalls.StartBackgroundJobWithRecordInRegister(Ref, "SMSDelivery_BonusesOperation", "ProlongedOperations.MessagesDeliverySend", vOperationParametrs);          
        EndIf;
    EndIf;

EndProcedure

#EndRegion
